#-*- coding:utf-8 -*-
from __future__ import unicode_literals

from flask_babel import gettext as _

TYPES_DESC = {
    "istj":
    _("严肃、安静、藉由集中心志与全力投入、及可被信赖获致成功。行事务实、有序、实际、逻辑、真实及可信赖十分留意且乐于任何事（工作、居家、生活均有良好组织及有序。负责任。照设定成效来作出决策且不畏阻挠与闲言会坚定为之。重视传统与忠诚。传统性的思考者或经理。"
      ),
    "isfj":
    _("安静、和善、负责任且有良心。行事尽责投入。安定性高，常居项目工作或团体之安定力量。愿投入、吃苦及力求精确。兴趣通常不在于科技方面。对细节事务有耐心。忠诚、考虑周到、知性且会关切他人感受。致力于创构有序及和谐的工作与家庭环境。"
      ),
    "infj":
    _("因为坚忍、创意及必须达成的意图而能成功。会在工作中投注最大的努力。默默强力的、诚挚的及用心的关切他人。因坚守原则而受敬重。提出造福大众利益的明确远景而为人所尊敬与追随。追求创见、关系及物质财物的意义及关联。想了解什么能激励别人及对他人具洞察力。光明正大且坚信其价值观。有组织且果断地履行其愿景。"
      ),
    "intj":
    _("具强大动力与本意来达成目的与创意—固执顽固者。有宏大的愿景且能快速在众多外界事件中找出有意义的模范。对所承负职务，具良好能力于策划工作并完成。具怀疑心、挑剔性、独立性、果决，对专业水准及绩效要求高。"
      ),
    "istp":
    _("冷静旁观者—安静、预留余地、弹性及会以无偏见的好奇心与未预期原始的幽默观察与分析。有兴趣于探索原因及效果，技术事件是为何及如何运作且使用逻辑的原理组构事实、重视效能。擅长于掌握问题核心及找出解决方式。分析成事的缘由且能实时由大量资料中找出实际问题的核心。"
      ),
    "isfp":
    _("羞怯的、安宁和善地、敏感的、亲切的、且行事谦虚。喜于避开争论，不对他人强加已见或价值观。无意于领导却常是忠诚的追随者。办事不急躁，安于现状无意于以过度的急切或努力破坏现况，且非成果导向。喜欢有自有的空间及照自订的时程办事。"
      ),
    "infp":
    _("安静观察者，具理想性与对其价值观及重要之人具忠诚心。希外在生活形态与内在价值观相吻合。具好奇心且很快能看出机会所在。常担负开发创意的触媒者。除非价值观受侵犯，行事会具弹性、适应力高且承受力强。具想了解及发展他人潜能的企图。想作太多且作事全神贯注。对所处境遇及拥有不太在意。具适应力、有弹性除非价值观受到威胁。"
      ),
    "intp":
    _("安静、自持、弹性及具适应力。特别喜爱追求理论与科学事理。习于以逻辑及分析来解决问题—问题解决者。最有兴趣于创意事务及特定工作，对聚会与闲聊无大兴趣。追求可发挥个人强烈兴趣的生涯。追求发展对有兴趣事务之逻辑解释。"
      ),
    "estp":
    _("擅长现场实时解决问题—解决问题者。喜欢办事并乐于其中及过程。倾向于喜好技术事务及运动，交结同好友人。具适应性、容忍度、务实性；投注心力于会很快具成效工作。不喜欢冗长概念的解释及理论。最专精于可操作、处理、分解或组合的真实事务。"
      ),
    "esfp":
    _("外向、和善、接受性、乐于分享喜乐予他人。喜欢与他人一起行动且促成事件发生，在学习时亦然。知晓事件未来的发展并会热列参与。最擅长于人际相处能力及具备完备常识，很有弹性能立即适应他人与环境。对生命、人、物质享受的热爱者。"
      ),
    "enfp":
    _("充满热忱、活力充沛、聪明的、富想象力的，视生命充满机会但期能得自他人肯定与支持。几乎能达成所有有兴趣的事。对难题很快就有对策并能对有困难的人施予援手。依赖能改善的能力而无须预作规划准备。为达目的常能找出强制自己为之的理由。即兴执行者。"
      ),
    "entp":
    _("反应快、聪明、长于多样事务。具激励伙伴、敏捷及直言讳专长。会为了有趣对问题的两面加予争辩。对解决新及挑战性的问题富有策略，但会轻忽或厌烦经常的任务与细节。兴趣多元，易倾向于转移至新生的兴趣。对所想要的会有技巧地找出逻辑的理由。长于看清础他人，有智能去解决新或有挑战的问题。"
      ),
    "estj":
    _("务实、真实、事实倾向，具企业或技术天份。不喜欢抽象理论；最喜欢学习可立即运用事理。喜好组织与管理活动且专注以最有效率方式行事以达致成效。具决断力、关注细节且很快作出决策—优秀行政者。会忽略他人感受。喜作领导者或企业主管。"
      ),
    "esfj":
    _("诚挚、爱说话、合作性高、受欢迎、光明正大的—天生的合作者及活跃的组织成员。重和谐且长于创造和谐。常作对他人有益事务。给予鼓励及称许会有更佳工作成效。最有兴趣于会直接及有形影响人们生活的事务。喜欢与他人共事去精确且准时地完成工作。"
      ),
    "enfj":
    _("热忱、易感应及负责任的--具能鼓励他人的领导风格。对别人所想或希求会表达真正关切且切实用心去处理。能怡然且技巧性地带领团体讨论或演示文稿提案。爱交际、受欢迎及富同情心。对称许及批评很在意。喜欢带引别人且能使别人或团体发挥潜能。"
      ),
    "entj":
    _("坦诚、具决策力的活动领导者。长于发展与实施广泛的系统以解决组织的问题。专精于具内涵与智能的谈话如对公众演讲。乐于经常吸收新知且能广开信息管道。易生过度自信，会强于表达自已创见。喜于长程策划及目标设定。"
      )
}

QUESTIONS = [{
    "q": _("在社交聚会中，你"),
    "a1": _("有时感到郁闷"),
    "t1": "I",
    "a2": _("常常乐在其中"),
    "t2": "E"
}, {
    "q": _("你通常"),
    "a1": _("和别人容易混熟"),
    "t1": "E",
    "a2": _("趋向自处一隅"),
    "t2": "I"
}, {
    "q": _("哪些人会更吸引你"),
    "a1": _("一个思想敏捷及非常聪颖的人"),
    "t1": "T",
    "a2": _("实事求是，具丰富常识的人"),
    "t2": "F"
}, {
    "q": _("在日常工作中，你会"),
    "a1": _("颇为喜欢处理迫使你分秒必争的突发"),
    "t1": "P",
    "a2": _("通常预先计划，以免要在压力下工作"),
    "t2": "J"
}, {
    "q": _("你认为别人一般"),
    "a1": _("要花很长时间才认识你"),
    "t1": "I",
    "a2": _("用很短的时间便认识你"),
    "t2": "E"
}, {
    "q": _("当你要在一个星期内完成一个大项目，你在开始的时候会"),
    "a1": _("把要做的不同工作依次列出"),
    "t1": "J",
    "a2": _("马上动工"),
    "t2": "P"
}, {
    "q": _("在社交场合中，你经常会感到"),
    "a1": _("与某些人很难打开话匣儿和保持对话"),
    "t1": "I",
    "a2": _("与多数人都能从容地长谈"),
    "t2": "E"
}, {
    "q": _("要做许多人也做的事，你比较喜欢"),
    "a1": _("按照一般认可的方法去做"),
    "t1": "S",
    "a2": _("构想一个自己的想法"),
    "t2": "N"
}, {
    "q": _("我倾向从何处得到力量?"),
    "a1": _("别人"),
    "t1": "E",
    "a2": _("我自己的想法"),
    "t2": "I"
}, {
    "q": _("当我参加一个社交聚会时，我倾向有更多的力气："),
    "a1": _("在夜色很深时，一旦我开始投入，也许就是最晚离开的那一个"),
    "t1": "E",
    "a2": _("在夜晚开始的时候，我就疲倦了并且想回家"),
    "t2": "I"
}, {
    "q": _("下列哪一种听起来比较吸引人？"),
    "a1": _("与我的情人到有很多人且社交活动频繁的地方"),
    "t1": "E",
    "a2": _("待在家中与我的情人做一些特别的事情，例如说观赏一部有趣的录像带并享用我最爱的外带食物"),
    "t2": "I"
}, {
    "q": _("在约会中，我通常："),
    "a1": _("整体来说蛮健谈的"),
    "t1": "E",
    "a2": _("较安静并保留，直到我觉得舒服"),
    "t2": "I"
}, {
    "q": _("过去，我倾向遇见我大部分情人："),
    "a1": _("在宴会中、夜总会、工作上、休闲活动中、会议上、或当朋友介绍我给他们的朋友时"),
    "t1": "E",
    "a2": _("透过私人的方式，例如个人广告、录像约会、或是由亲密的朋友和家人介绍"),
    "t2": "I"
}, {
    "q": _("我倾向拥有："),
    "a1": _("很多认识的人和很亲密的朋友"),
    "t1": "E",
    "a2": _("一些很亲密的朋友和一些认识的人"),
    "t2": "I"
}, {
    "q": _("过去，我爱的人和情人倾向对我说这些："),
    "a1": _("你难道不可以安静一点吗？"),
    "t1": "E",
    "a2": _("可以请你从你的世界中出来一下吗？"),
    "t2": "I"
}, {
    "q": _("我倾向透过以下方式收集信息："),
    "a1": _("我对有可能发生之事的想象和期望"),
    "t1": "N",
    "a2": _("我对目前状况实际认知"),
    "t2": "S"
}, {
    "q": _("我倾向相信："),
    "a1": _("我的直觉"),
    "t1": "N",
    "a2": _("我直接的观察和现成的经验"),
    "t2": "S"
}, {
    "q": _("当我置身于一段关系中时，我倾向相信："),
    "a1": _("永远有进步的空间"),
    "t1": "N",
    "a2": _("若它没有被破坏，别修补它"),
    "t2": "S"
}, {
    "q": _("当我对一个约会觉得放心时，我倾向谈论："),
    "a1": _("未来，关于改进或发明事物，和生活的种种可能性"),
    "t1": "N",
    "a2": _("实际的，具体的，关于「此时此地」的事物"),
    "t2": "S"
}, {
    "q": _("我是这种人："),
    "a1": _("喜欢先看整个大局面"),
    "t1": "N",
    "a2": _("喜欢先拿握细节"),
    "t2": "S"
}, {
    "q": _("我是这种类型的人："),
    "a1": _("与其活在现实中，我选择活在我的想象里"),
    "t1": "N",
    "a2": _("与其活在我的想象里，我选择活在现实中"),
    "t2": "S"
}, {
    "q": _("我倾向如此做决定："),
    "a1": _("首先依我的心意，然依我的逻辑"),
    "t1": "F",
    "a2": _("首先依我的逻辑，然后依我的心意"),
    "t2": "T"
}, {
    "q": _("我倾向比较能够察觉到："),
    "a1": _("当人们需要情感上的支持时"),
    "t1": "F",
    "a2": _("当人们不合逻辑时"),
    "t2": "T"
}, {
    "q": _("当和某人分手时:"),
    "a1": _("我通常让自己的情绪深陷其中，很难才能抽身而出"),
    "t1": "F",
    "a2": _("虽然我觉得受伤，但一旦下定决心，我会直截了当地将过去恋人的影子甩开"),
    "t2": "T"
}, {
    "q": _("当与一个人交往时，我倾向评量："),
    "a1": _("情感上的兼容性，表达爱意和对另一半的需求很敏感"),
    "t1": "F",
    "a2": _("智能上的兼容性，沟通重要的想法，客观地讨论和辩论事情"),
    "t2": "T"
}, {
    "q": _("当我不同意我情人的想法时："),
    "a1": _("我尽可能地避免伤害对方的感受"),
    "t1": "F",
    "a2": _("我通常毫无保留地说话，并且对我的情人直言直语，因为对的就是对的"),
    "t2": "T"
}, {
    "q": _("认识我的人倾向形容我为："),
    "a1": _("热情和敏感"),
    "t1": "F",
    "a2": _("逻辑和明确"),
    "t2": "T"
}, {
    "q": _("我把大部分和别人的相遇视为："),
    "a1": _("友善及重要的"),
    "t1": "F",
    "a2": _("另有目的"),
    "t2": "T"
}, {
    "q": _("若我有时间和金钱，我的朋友邀请我到国外度假，并且在一天前才通知，我会："),
    "a1": _("必须先检查我的时间表"),
    "t1": "J",
    "a2": _("立即收拾行装"),
    "t2": "P"
}, {
    "q": _("在第一次约会中，我："),
    "a1": _("若我所约的人来迟了，我会很不高兴"),
    "t1": "J",
    "a2": _("一点都不在乎，因为我自己已常常迟到"),
    "t2": "P"
}, {
    "q": _("我偏好："),
    "a1": _("事先知道约会的行程：要去哪里、有谁参加、该如何打扮"),
    "t1": "J",
    "a2": _("让约会自然地发生，不做先前太多的计划"),
    "t2": "P"
}, {
    "q": _("我选择的生活循环着："),
    "a1": _("日程表和组织"),
    "t1": "J",
    "a2": _("自然发生和弹性"),
    "t2": "P"
}, {
    "q": _("哪一项较为常见："),
    "a1": _("我准时出席而其它人迟到"),
    "t1": "J",
    "a2": _("其它人都准则出席而我迟到"),
    "t2": "P"
}, {
    "q": _("我喜欢："),
    "a1": _("下定决心并且做出最后肯定的结论"),
    "t1": "J",
    "a2": _("开放我的选择并且持续收集信息"),
    "t2": "P"
}, {
    "q": _("我是这类型的人："),
    "a1": _("喜欢在一个时间里专心于一件事情直到完成"),
    "t1": "J",
    "a2": _("享受同时进行好几件事情"),
    "t2": "P"
}, {
    "q": _("当你要外出一整天，你会"),
    "a1": _("计划你要做什么和在什么时候做"),
    "t1": "J",
    "a2": _("说去就去"),
    "t2": "P"
}, {
    "q": _("你认为自己是一个"),
    "a1": _("较为随兴所至的人"),
    "t1": "P",
    "a2": _("较为有条理的人"),
    "t2": "J"
}, {
    "q": _("假如你是一位老师，你会选教"),
    "a1": _("以事实为主的课程"),
    "t1": "S",
    "a2": _("涉及理论的课程"),
    "t2": "N"
}, {
    "q": _("你通常:"),
    "a1": _("与人容易混熟"),
    "t1": "E",
    "a2": _("比较沉静或矜持"),
    "t2": "I"
}, {
    "q": _("一般来说，你和哪些人比较合得来"),
    "a1": _("富于想象力的人"),
    "t1": "N",
    "a2": _("现实的人"),
    "t2": "S"
}, {
    "q": _("你是否经常让"),
    "a1": _("你的情感支配你的理智"),
    "t1": "F",
    "a2": _("你的理智主宰你的情感"),
    "t2": "T"
}, {
    "q": _("处理许多事情上，你会喜欢"),
    "a1": _("凭兴所至行事"),
    "t1": "P",
    "a2": _("按照计划行事"),
    "t2": "J"
}, {
    "q": _("你是否"),
    "a1": _("容易让人了解"),
    "t1": "E",
    "a2": _("难于让人了解"),
    "t2": "I"
}, {
    "q": _("按照程序表做事"),
    "a1": _("合你心意"),
    "t1": "J",
    "a2": _("令你感到束缚"),
    "t2": "P"
}, {
    "q": _("当你有一份特别的任务，你会喜欢"),
    "a1": _("开始前小心组织计划"),
    "t1": "J",
    "a2": _("边做边找须做什么"),
    "t2": "P"
}, {
    "q": _("在大多数情况下，你会选择"),
    "a1": _("顺其自然"),
    "t1": "P",
    "a2": _("按程序表做事"),
    "t2": "J"
}, {
    "q": _("大多数人会说你是一个"),
    "a1": _("重视自我隐私的人"),
    "t1": "I",
    "a2": _("非常坦率开放的人"),
    "t2": "E"
}, {
    "q": _("你宁愿被人认为是一个"),
    "a1": _("实事求是的人"),
    "t1": "S",
    "a2": _("机灵的人"),
    "t2": "N"
}, {
    "q": _("在一大群人当中，通常是"),
    "a1": _("你介绍大家认识"),
    "t1": "E",
    "a2": _("别人介绍你"),
    "t2": "I"
}, {
    "q": _("你会跟哪些人做朋友"),
    "a1": _("常提出新主意的"),
    "t1": "N",
    "a2": _("脚踏实地的"),
    "t2": "S"
}, {
    "q": _("你倾向"),
    "a1": _("重视感情多于逻辑"),
    "t1": "F",
    "a2": _("重视逻辑多于感情"),
    "t2": "T"
}, {
    "q": _("你比较喜欢"),
    "a1": _("坐观事情发展才作计划"),
    "t1": "P",
    "a2": _("很早就作计划"),
    "t2": "J"
}, {
    "q": _("你喜欢花很多的时间"),
    "a1": _("一个人独处"),
    "t1": "I",
    "a2": _("和别人在一起"),
    "t2": "E"
}, {
    "q": _("你比较喜欢"),
    "a1": _("很早便把约会、社交聚集等事情安排妥当"),
    "t1": "J",
    "a2": _("无拘无束，看当时有什么好玩就做什么"),
    "t2": "P"
}, {
    "q": _("计划一个旅程时，你较喜欢"),
    "a1": _("大部分的时间都是跟当天的感觉行事"),
    "t1": "P",
    "a2": _("事先知道大部分的日子会做什么"),
    "t2": "J"
}, {
    "q": _("你刚认识的朋友能否说出你的兴趣"),
    "a1": _("马上可以"),
    "t1": "E",
    "a2": _("要待他们真正了解你之后才可以"),
    "t2": "I"
}, {
    "q": _("你通常较喜欢的科目是"),
    "a1": _("讲授概念和原则的"),
    "t1": "N",
    "a2": _("讲授事实和数据的"),
    "t2": "S"
}, {
    "q": _("哪个是较高的赞誉，或称许为"),
    "a1": _("一贯感性的人"),
    "t1": "F",
    "a2": _("一贯理性的人"),
    "t2": "T"
}, {
    "q": _("你认为按照程序表做事"),
    "a1": _("有时是需要的，但一般来说你不大喜欢这样做"),
    "t1": "P",
    "a2": _("大多数情况下是有帮助而且是你喜欢做的"),
    "t2": "J"
}, {
    "q": _("和一群人在一起，你通常会选"),
    "a1": _("跟你很熟悉的个别人谈话"),
    "t1": "I",
    "a2": _("参与大伙的谈话"),
    "t2": "E"
}, {
    "q": _("在社交聚会上，你会"),
    "a1": _("是说话很多的一个"),
    "t1": "E",
    "a2": _("让别人多说话"),
    "t2": "I"
}, {
    "q": _("把周末期间要完成的事列成清单，这个主意会"),
    "a1": _("合你意"),
    "t1": "J",
    "a2": _("使你提不起劲"),
    "t2": "P"
}, {
    "q": _("哪个是较高的赞誉"),
    "a1": _("能干的"),
    "t1": "T",
    "a2": _("富有同情心"),
    "t2": "F"
}, {
    "q": _("你通常喜欢"),
    "a1": _("事先安排你的社交约会"),
    "t1": "J",
    "a2": _("随兴之所至做事"),
    "t2": "P"
}, {
    "q": _("总的说来，要做一个大型作业时，你会选"),
    "a1": _("边做边想该做什么"),
    "t1": "P",
    "a2": _("首先把工作按步细分"),
    "t2": "J"
}, {
    "q": _("你能否滔滔不绝地与人聊天"),
    "a1": _("只限于跟你有共同兴趣的人"),
    "t1": "I",
    "a2": _("几乎跟任何人都可以"),
    "t2": "E"
}, {
    "q": _("你会"),
    "a1": _("跟随一些证明有效的方法"),
    "t1": "S",
    "a2": _("分析还有什么毛病，及针对尚未解决的难题"),
    "t2": "N"
}, {
    "q": _("为乐趣而阅读时，你会"),
    "a1": _("喜欢奇特或创新的表达方式"),
    "t1": "N",
    "a2": _("喜欢作者直话直说"),
    "t2": "S"
}, {
    "q": _("你宁愿替哪一类上司（或者老师）工作"),
    "a1": _("天性淳良，但常常前后不一的"),
    "t1": "T",
    "a2": _("言词尖锐但永远合乎逻辑的"),
    "t2": "N"
}, {
    "q": _("你做事多数是"),
    "a1": _("按当天心情去做"),
    "t1": "P",
    "a2": _("照拟好的程序表去做"),
    "t2": "J"
}, {
    "q": _("你是否"),
    "a1": _("可以和任何人按需求从容地交谈"),
    "t1": "E",
    "a2": _("只是对某些人或在某种情况下才可以畅所欲言"),
    "t2": "I"
}, {
    "q": _("要作决定时，你认为比较重要的是"),
    "a1": _("据事实衡量"),
    "t1": "T",
    "a2": _("考虑他人的感受和意见"),
    "t2": "F"
}]
